{
    "version": 1,
    "domain": "devices",
    "trBrief": "Working with devices",

    "trDescription": "WORKING WITH DEVICES\n\nAvailable devices can be listed with the 'device list' command. Additional devices may be defined using Sailfish IDE (Qt Creator). Devices corresponding to available Sailfish OS emulators are added automatically. Emulators can be managed and controlled using the 'emulator' command. Packages can be deployed to a device with the 'deploy' command. The device to deploy to is determined by the 'device' configuration option.\n\nOn Windows, under the MSYS2 environment (this is the case of using sfdk under Git Bash), command line arguments to sfdk are subject to pathname conversion realized on MSYS2 side (applies to all native Windows programs executed from the MSYS2 environment). All arguments or their portions that resemble POSIX absolute paths are converted to corresponding Windows paths which may or may not exist. This is often unwanted for sfdk use. E.g., when a path on a remove device is passed as an argument, it is incorrectly converted to a local Windows path:\n\n$ sfdk device exec ls -l /usr/bin/myapp\nls: cannot access C:/Program Files/Git/usr/bin/myapp: No such file or directory\n\nIt is possible to selectively disable pathname conversion with the help of the MSYS2_ARG_CONV_EXCL environment variable. It is also possible to work it around by using two leading slashes in the POSIX absolute path, imitating an UNC-like path which is not subject to pathname conversion.\n\n$ export MSYS2_ARG_CONV_EXCL='*'\n$ sfdk device exec ls -l /usr/bin/myapp\n-rwxr-xr-x 1 root root 104648 Oct 13 23:21 /usr/bin/myapp\n$ unset MSYS2_ARG_CONV_EXCL\n$ sfdk device exec ls -l //usr/bin/myapp\n-rwxr-xr-x 1 root root 104648 Oct 13 23:21 //usr/bin/myapp\n\nCheck MSYS2 documentation for more information.",

    "worker":
    {
        "type": "builtin",
        "version": 1
    },

    "commands":
    [
        {
            "name": "device",
            "trSynopsis": "list\nexec [<name-or-idx>] [--] [<command> [<arg>...]]",
            "trBrief": "Maintain and control registered devices",
            "trDescription": "Registered devices can be listed with the 'list' command.\n\nThe 'exec' command allows executing an arbitrary <command> on the device specified with name or index as reported by the 'list' command. If no <name-or-idx> is passed, the device selected with the 'device' configuration option will be used. If no <command> is specified, an interactive shell is executed."
        },
        {
            "name": "emulator",
            "trSynopsis": "list [-a|--available]\n{start|stop|status} [<name-or-idx>]\nset [<name-or-idx>] [--] <property>=<value>...\nshow [<name-or-idx>]\nexec [<name-or-idx>] [--] [<command> [<arg>...]]\ninstall <name>\nremove <name>",
            "trBrief": "Maintain and control emulators",
            "trDescription": "The 'list' command lists the installed emulators. If the '--available' option is used, emulators available for installation from SDK repositories are listed, including those already installed. The status flags that may appear in the output are described further below.\n\nThose of the other commands that accept a <name-or-idx> argument, can be passed an emulator name or index as reported by the 'list' command without the '--available' option used. If a <name-or-idx> argument is omitted, the emulator at index '0' is assumed.\n\nEmulators available from SDK repositories may be installed using the 'install' command. Installed emulators may be removed using the 'remove' command. The 'install' and 'remove' commands accept <name> as reported by the 'list' command with '--available' option used (in case it differs in the view provided without '--available').\n\nThe 'start' and 'stop' commands allow to control the emulator virtual machine conveniently. Starting an emulator explicitly is usually not required - commands that need the emulator running will ensure it is running. The 'status' command prints status information.\n\nEmulator properties can be set with the 'set' command and queried with the 'show' command. Known properties are described further below.\n\nThe 'exec' command allows executing an arbitrary <command> inside the emulator. If no <command> is specified, an interactive shell is executed.\n\n\nStatus flags:\n\navailable\n    Emulator available from SDK repositories, available for installation using the 'install' command.\n\ninstalled\n    Emulator available from SDK repositories, currently installed\n\nsdk-provided\n    Synonym for 'installed'. Used in views where 'user-defined' may appear.\n\nuser-defined\n    Emulator installed using other method. sfdk does not currently provide a way to achieve this, other tools may.\n\nlatest\n    Emulator available from SDK repositories under the symbolic (floating) version 'latest'; subject to automatic upgrade between SDK releases.\n\nearly-access\n    Emulator available from SDK repositories under the symbolic (floating) version 'early-access'; subject to automatic upgrade between SDK releases.\n\n\nEmulator properties:\n\nvm.cpuCount <number>\n    The number of virtual CPUs inside the emulator virtual machine. The maximum is limited by the number of CPUs available on the host.\n\nvm.memorySize <megabytes>\n    The amount of memory (RAM) available to the emulator virtual machine. The maximum is limited by the size of the physical memory available on the host.\n\nvm.storageSize <megabytes>\n    The amount of storage (disk) space available to the emulator virtual machine. Storage size can only grow; shrinking is not possible."
        }
    ],

    "options":
    [
    ]
}
